snlkuharlocal/src/Documents/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвиженияДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоПоАвансамОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Приход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Затраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаБанкКлиент</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД_СтрокиПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентПоБанку</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС_Бух</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_СтрокиПлатежа</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КаналСбыта</name>
      <type>
        <types>CatalogRef.КаналСбыта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкиЗатрат</name>
    <attributes>
      <name>ИД_СтрокиПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>Затраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КаналСбыта</name>
      <type>
        <types>CatalogRef.КаналСбыта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/СостоянияЗаявокНаОплату/СостоянияЗаявокНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаявокНаОплату</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОплате</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Оплачена</name>
  </enumValues>
  <enumValues>
    <name>НеОплачена</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноОплачена</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ДвиженияДенежныхСредств/ObjectModule.bsl
Функция РаспределитьСуммы(СтрокаТЧ,СуммаКРаспределению)	
	БР=Новый ТаблицаЗначений; //база распределения
	БР.Колонки.Добавить("СтатьяДДС");
	БР.Колонки.Добавить("Подразделение");
	БР.Колонки.Добавить("КапитальныеЗатраты");
	БР.Колонки.Добавить("ПериодРасходов");	
	БР.Колонки.Добавить("Проект");	
	БР.Колонки.Добавить("СубЗатрата");	
	БР.Колонки.Добавить("База",		ПолучитьОписаниеТиповЧисла(19,2));
	БР.Колонки.Добавить("Сумма",	ПолучитьОписаниеТиповЧисла(19,2));
	//крохин начало 24.01.2012
	//с 01.01.2012 возможны затраты и взаиморасчеты в одной строке
	БР.Колонки.Добавить("Затраты");
	//крохин конец 24.01.2012 
	//++Данилова Е.В. 24.04.2026 HELP-9467
	БР.Колонки.Добавить("КаналСбыта");
	//--Данилова Е.В. 24.04.2026 
	
	СтрокиРаспределения=Новый Массив;
	Если НЕ ПустаяСтрока(СтрокаТЧ.ИД_СтрокиПлатежа) Тогда	
		Отбор=Новый Структура("ИД_СтрокиПлатежа",СтрокаТЧ.ИД_СтрокиПлатежа);
		СтрокиРаспределения=РасшифровкиЗатрат.НайтиСтроки(Отбор);
	КонецЕсли;
	
	Если СтрокиРаспределения.ВГраница()<0 Тогда
		СтрокаБР=БР.Добавить();
		
		СтрокаБР.СтатьяДДС			=СтрокаТЧ.СтатьяДДС;
		СтрокаБР.Подразделение		=СтрокаТЧ.Подразделение;
		//++Данилова Е.В. 24.04.2026 HELP-9467
		СтрокаБР.КаналСбыта			= СтрокаТЧ.КаналСбыта;
		//--Данилова Е.В. 24.04.2026
		СтрокаБР.КапитальныеЗатраты	=СтрокаТЧ.КапитальныеЗатраты;
		СтрокаБР.ПериодРасходов		=?(ЗначениеЗаполнено(СтрокаТЧ.ПериодРасходов),СтрокаТЧ.ПериодРасходов,Дата);
		СтрокаБР.Проект				=СтрокаТЧ.Проект;
		СтрокаБР.СубЗатрата			=СтрокаТЧ.СубЗатрата;
		
		СтрокаБР.Сумма			=СуммаКРаспределению;
		СтрокаБР.База			=СуммаКРаспределению;
	Иначе
		Для Каждого СтрокаР Из СтрокиРаспределения Цикл
			СтрокаБР=БР.Добавить();		
			
			СтрокаБР.СтатьяДДС			= ?(ЗначениеЗаполнено(СтрокаР.СтатьяДДС)	,		СтрокаР.СтатьяДДС			,СтрокаТЧ.СтатьяДДС);
			СтрокаБР.Подразделение		= ?(ЗначениеЗаполнено(СтрокаР.Подразделение),		СтрокаР.Подразделение		,СтрокаТЧ.Подразделение);
			СтрокаБР.КапитальныеЗатраты	= ?(ЗначениеЗаполнено(СтрокаР.КапитальныеЗатраты),	СтрокаР.КапитальныеЗатраты	,СтрокаТЧ.КапитальныеЗатраты);
			СтрокаБР.Проект				= ?(ЗначениеЗаполнено(СтрокаР.Проект),				СтрокаР.Проект				,СтрокаТЧ.Проект);
			СтрокаБР.СубЗатрата			= ?(ЗначениеЗаполнено(СтрокаР.СубЗатрата),			СтрокаР.СубЗатрата			,СтрокаТЧ.СубЗатрата);
			
			Если ЗначениеЗаполнено(СтрокаР.ПериодРасходов) Тогда
				СтрокаБР.ПериодРасходов		= НачалоМесяца(СтрокаР.ПериодРасходов);
			ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.ПериодРасходов) Тогда
				СтрокаБР.ПериодРасходов		= НачалоМесяца(СтрокаТЧ.ПериодРасходов);
			Иначе
				СтрокаБР.ПериодРасходов		= НачалоМесяца(Дата);
			КонецЕсли;			
			
			СтрокаБР.База			= СтрокаР.Сумма;
			//крохин начало 24.01.2012
			//с 01.01.2012 возможны затраты и взаиморасчеты в одной строке
			СтрокаБР.затраты =СтрокаР.затраты;
			//крохин конец 24.01.2012
			//++Данилова Е.В. 24.04.2026 HELP-9467
			СтрокаБР.КаналСбыта	= СтрокаР.КаналСбыта;
			//--Данилова Е.В. 24.04.2026
		КонецЦикла;
		
		МаксСтрокаБР	=Неопределено;
		МаксСумма		=-100000000000000000000000000;
		
		БазаВсего=БР.Итог("База");
		
		Если БазаВсего=0 Тогда
			СообщитьОбОшибке("По строке №: "+СтрокаТЧ.НомерСтроки+" нулевая база распределения расходов !!!");
			
			БР.ЗаполнитьЗначения(1,"База");
			БазаВсего=БР.Итог("База");
		КонецЕсли; 
		
		Для Каждого СтрокаБР Из БР Цикл		
			СтрокаБР.Сумма=СуммаКРаспределению*СтрокаБР.База/БазаВсего;
			
			Если Модуль(СтрокаБР.Сумма)>МаксСумма Тогда
				МаксСумма	=Модуль(СтрокаБР.Сумма);
				МаксСтрокаБР=СтрокаБР;			
			КонецЕсли; 
		КонецЦикла; 
		
		Если БР.Итог("Сумма")<>СуммаКРаспределению И МаксСтрокаБР<>Неопределено Тогда
			МаксСтрокаБР.Сумма=МаксСтрокаБР.Сумма+(СуммаКРаспределению-БР.Итог("Сумма"));
		КонецЕсли; 
	КонецЕсли;	
	
	Возврат БР;
КонецФункции //ПолучитьЗатраты(СтрокаТЧ)

Процедура ОбработкаПроведения(Отказ, Режим) Экспорт
	ВалютаУпр		= ПараметрыСеанса.ВалютаУпр_2009;	
	КурсУпр			= ПолучитьКурсВалюты(ВалютаУпр,Дата).Курс;
	
	КэшКурсовНаДату	= Новый Соответствие;	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Для Каждого СтрокаТЧ Из Платежи Цикл		
		Контрагент=?(СтрокаТЧ.ФизЛицо.Пустая(),СтрокаТЧ.Контрагент,СтрокаТЧ.ФизЛицо);
		
		СуммаДок	=СтрокаТЧ.Приход	-СтрокаТЧ.Расход;
		СуммаДокВал	=СтрокаТЧ.ПриходВал	-СтрокаТЧ.РасходВал;
		
		КурсВалютыОперации=КэшКурсовНаДату.Получить(СтрокаТЧ.Валюта);
		Если КурсВалютыОперации=Неопределено Тогда
			КурсВалютыОперации=ПолучитьКурсВалюты_ПоРусски(СтрокаТЧ.Валюта,Дата);							
			КэшКурсовНаДату.Вставить(СтрокаТЧ.Валюта,КурсВалютыОперации);
		КонецЕсли;
		
		Ошибки="";	
		
		СтрокиРаспределения=Новый Массив;
		Если НЕ ПустаяСтрока(СтрокаТЧ.ИД_СтрокиПлатежа) Тогда	
			Отбор=Новый Структура("ИД_СтрокиПлатежа",СтрокаТЧ.ИД_СтрокиПлатежа);
			СтрокиРаспределения=РасшифровкиЗатрат.НайтиСтроки(Отбор);
		КонецЕсли;
		
		Если СтрокиРаспределения.ВГраница()<0 Тогда
			ЕстьСтрокиРаспределения = Ложь;
		Иначе
			ЕстьСтрокиРаспределения = Истина;
		КонецЕсли;
		
		Если Дата >= '20120101' И ЕстьСтрокиРаспределения Тогда
			БР=РаспределитьСуммы(СтрокаТЧ,СтрокаТЧ.Расход-СтрокаТЧ.Приход);
			Для Каждого СтрокаБР Из БР Цикл
				Если СтрокаБР.Затраты Тогда //ЗАТРАТЫ			
					Если СтрокаБР.СтатьяДДС.Пустая() Тогда
						Ошибки=Ошибки+"Не указана статья затрат в распределении! Строка: "+СтрокаТЧ.НомерСтроки;				
					КонецЕсли; 
					Если СтрокаБР.Подразделение.Пустая() Тогда		
						Ошибки=Ошибки+"Не указано подразделение в распределении! Строка: "+СтрокаТЧ.НомерСтроки;
					КонецЕсли; 
					
					Если НЕ ПустаяСтрока(Ошибки) И НЕ ЭтотОбъект.ОбменДанными.Загрузка  Тогда	//Катаев- 10/01/14
						Сообщить(Ошибки,СтатусСообщения.Важное);				
					КонецЕсли; 
					
					СуммаДок 					= СтрокаБР.Сумма;				
					Если СуммаДок=0 Тогда Продолжить КонецЕсли; 
					
					Движение 					= Движения.Затраты.Добавить();
					Движение.ВидДвижения		= ?(СтрокаТЧ.Приход-СтрокаТЧ.Расход>0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);	
					
					Движение.Период				= Дата;
					
					Движение.Подразделение		= СтрокаБР.Подразделение;
					//++Данилова Е.В. 24.04.2026 HELP-9467
					Если Дата >= Дата(2026,04,01) Тогда 
						Движение.КаналСбыта			= СтрокаБР.КаналСбыта;
					КонецЕсли;
					//--Данилова Е.В. 24.04.2026 
					Движение.СтатьяЗатрат		= СтрокаБР.СтатьяДДС;
					Движение.КапитальныеЗатраты	= СтрокаБР.КапитальныеЗатраты;
					Движение.ПериодРасходов		= НачалоМесяца(СтрокаБР.ПериодРасходов);
					Движение.Проект				= СтрокаБР.Проект;
					Движение.СубЗатрата			= СтрокаБР.СубЗатрата;
					
					Движение.СуммаУпр			= Модуль(глПересчет(СуммаДок,СтрокаТЧ.Валюта,КурсВалютыОперации,ВалютаУпр,	КурсУпр));
					
					Движение.СуммаДокумента		= Модуль(СуммаДок);
					Движение.ВалютаДокумента	= СтрокаТЧ.Валюта;				
					
					Движение.Контрагент			= Контрагент;
					Движение.Договор			= СтрокаТЧ.Договор;
					Движение.Комментарий        = СтрокаТЧ.НазначениеПлатежа;
					
					Движение.ДатаЗаписи			= ТекущаяДата();
				Иначе //ВЗАИМОРАСЧЕТЫ
					СуммаДок 					= СтрокаБР.Сумма;
					Если Контрагент.Пустая() Тогда
						Ошибки=Ошибки+"Не указан контрагент или физ. лицо ! Строка: "+СтрокаТЧ.НомерСтроки;											
					КонецЕсли; 
					
					Если НЕ ПустаяСтрока(Ошибки) Тогда			
						Сообщить(Ошибки,СтатусСообщения.Важное);				
					КонецЕсли;
					
					ВалютаРасчетов				= ПолучитьВалютуРасчетов(СтрокаТЧ.Договор);
					
					Движение 					= Движения.Взаиморасчеты.Добавить();
					Движение.ВидДвижения		= ?(СтрокаТЧ.Приход-СтрокаТЧ.Расход>0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
					
					Движение.Период				= Дата;
					Движение.Контрагент			= Контрагент;
					Движение.Договор 			= СтрокаТЧ.Договор;			
					
					Если СтрокаТЧ.Валюта<>ВалютаРасчетов И СуммаДокВал<>0 Тогда
						Движение.СуммаВал		= Модуль(СуммаДокВал);
					Иначе
						Движение.СуммаВал		= Модуль(глПересчет(СуммаДок,СтрокаТЧ.Валюта,СтрокаТЧ.Курс,ВалютаРасчетов,Дата));			
					КонецЕсли; 
					
					Движение.СуммаУпр			= Модуль(глПересчет(СуммаДок,СтрокаТЧ.Валюта,КурсВалютыОперации,ВалютаУпр,КурсУпр));
					
					Движение.СуммаДокумента		= Модуль(СуммаДок);
					Движение.ВалютаДокумента	= СтрокаТЧ.Валюта;	
					
					Движение.СтатьяДДС			= СтрокаБР.СтатьяДДС;	         
					//+++ Чирков 10.03.2026
					Движение.УИД_СтрокиПлатежа 	= СтрокаТЧ.УИД_СтрокиПлатежа;
					//--- Чирков 10.03.2026
				КонецЕсли; 
			КонецЦикла;
			
		Иначе
			Если СтрокаТЧ.Затраты Тогда //ЗАТРАТЫ			
				Если СтрокаТЧ.СтатьяДДС.Пустая() Тогда
					Ошибки=Ошибки+"Не указана статья затрат ! Строка: "+СтрокаТЧ.НомерСтроки;				
				КонецЕсли; 
				Если СтрокаТЧ.Подразделение.Пустая() Тогда		
					Ошибки=Ошибки+"Не указано подразделение ! Строка: "+СтрокаТЧ.НомерСтроки;
				КонецЕсли; 
				
				Если НЕ ПустаяСтрока(Ошибки) И НЕ ЭтотОбъект.ОбменДанными.Загрузка  Тогда //Катаев- 10/01/14
					Сообщить(Ошибки,СтатусСообщения.Важное);				
				КонецЕсли; 
				
				БР=РаспределитьСуммы(СтрокаТЧ,СтрокаТЧ.Расход-СтрокаТЧ.Приход);
				
				Для Каждого СтрокаБР Из БР Цикл
					СуммаДок 					= СтрокаБР.Сумма;				
					Если СуммаДок=0 Тогда Продолжить КонецЕсли; 
					
					Движение 					= Движения.Затраты.Добавить();
					Движение.ВидДвижения		= ?(СуммаДок<0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);	
					
					Движение.Период				= Дата;
					
					Движение.Подразделение		= СтрокаБР.Подразделение; 
					//++Данилова Е.В. 24.04.2026 HELP-9467
					Если Дата >= Дата(2026,04,01) Тогда 
						Движение.КаналСбыта			= СтрокаБР.КаналСбыта;
					КонецЕсли;
					//--Данилова Е.В. 24.04.2026
					Движение.СтатьяЗатрат		= СтрокаБР.СтатьяДДС;
					Движение.КапитальныеЗатраты	= СтрокаБР.КапитальныеЗатраты;
					Движение.ПериодРасходов		= НачалоМесяца(СтрокаБР.ПериодРасходов);
					Движение.Проект				= СтрокаБР.Проект;
					Движение.СубЗатрата			= СтрокаБР.СубЗатрата;
					
					Движение.СуммаУпр			= Модуль(глПересчет(СуммаДок,СтрокаТЧ.Валюта,КурсВалютыОперации,ВалютаУпр,	КурсУпр));
					
					Движение.СуммаДокумента		= Модуль(СуммаДок);
					Движение.ВалютаДокумента	= СтрокаТЧ.Валюта;				
					
					Движение.Контрагент			= Контрагент;
					Движение.Договор			= СтрокаТЧ.Договор;
					Движение.Комментарий        = СтрокаТЧ.НазначениеПлатежа;
					
					
					Движение.ДатаЗаписи			= ТекущаяДата();
				КонецЦикла;
			Иначе //ВЗАИМОРАСЧЕТЫ
				Если Контрагент.Пустая() Тогда
					Ошибки=Ошибки+"Не указан контрагент или физ. лицо ! Строка: "+СтрокаТЧ.НомерСтроки;											
				КонецЕсли; 
				
				Если НЕ ПустаяСтрока(Ошибки) Тогда			
					Сообщить(Ошибки,СтатусСообщения.Важное);				
				КонецЕсли;
				
				ВалютаРасчетов				= ПолучитьВалютуРасчетов(СтрокаТЧ.Договор);
				
				Движение 					= Движения.Взаиморасчеты.Добавить();
				Движение.ВидДвижения		= ?(СуммаДок>0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
				
				Движение.Период				= Дата;
				Движение.Контрагент			= Контрагент;
				Движение.Договор 			= СтрокаТЧ.Договор;			
				
				Если СтрокаТЧ.Валюта<>ВалютаРасчетов И СуммаДокВал<>0 Тогда
					Движение.СуммаВал		= Модуль(СуммаДокВал);
				Иначе
					Движение.СуммаВал		= Модуль(глПересчет(СуммаДок,СтрокаТЧ.Валюта,СтрокаТЧ.Курс,ВалютаРасчетов,Дата));			
				КонецЕсли; 
				
				Движение.СуммаУпр			= Модуль(глПересчет(СуммаДок,СтрокаТЧ.Валюта,КурсВалютыОперации,ВалютаУпр,КурсУпр));
				
				Движение.СуммаДокумента		= Модуль(СуммаДок);
				Движение.ВалютаДокумента	= СтрокаТЧ.Валюта;
				
				Движение.СтатьяДДС			= СтрокаТЧ.СтатьяДДС;
				//+++ Чирков 10.03.2026
				Движение.УИД_СтрокиПлатежа 	= СтрокаТЧ.УИД_СтрокиПлатежа;
				//--- Чирков 10.03.2026
			КонецЕсли;
			
		КонецЕсли;
		
		//крохин конец 24.01.2012
		
		Если БанковскийСчет.Метаданные().Имя = "БанковскиеСчета" И БанковскийСчет.Подразделение<>ПараметрыСеанса.ЭтотУзел.Подразделение И ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда Продолжить КонецЕсли;
		Если БанковскийСчет.Метаданные().Имя <> "БанковскиеСчета" И ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда Продолжить КонецЕсли;
		
		//ДДС
		Если СтрокаТЧ.Приход<>0 Тогда			
			БР=РаспределитьСуммы(СтрокаТЧ,СтрокаТЧ.Приход);			
			Для Каждого СтрокаБР Из БР Цикл				
				Движение					= Движения.ДенежныеСредства.Добавить();
				
				Движение.Период				= Дата;
				Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;			
				Движение.БанковскийСчет		= БанковскийСчет;			
				Движение.Валюта				= СтрокаТЧ.Валюта;
				
				Движение.Сумма				= СтрокаБР.Сумма;
				Если Дата>='20090101' Тогда
					Движение.СуммаУпр		= глПересчет(СтрокаБР.Сумма,СтрокаТЧ.Валюта,КурсВалютыОперации,ВалютаУпр,КурсУпр);
				КонецЕсли; 
				
				Движение.СуммаДокумента		= СтрокаБР.Сумма;				
				Движение.ВалютаДокумента	= СтрокаТЧ.Валюта;
				
				Если Дата >= '20110301' Тогда
					Движение.СтатьяДДС			= СтрокаБР.СтатьяДДС;
					Если  Движение.СтатьяДДС = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
						Движение.СтатьяДДС			= СтрокаТЧ.СтатьяДДС;	
					КонецЕсли;
				Иначе
					Движение.СтатьяДДС			= СтрокаТЧ.СтатьяДДС;
				КонецЕсли;
				Движение.Отправитель		= Контрагент;
				Движение.Договор			= СтрокаТЧ.Договор;
				Движение.Комментарий        = СтрокаТЧ.НазначениеПлатежа;
				Если Дата > '20100901' Тогда
					Движение.Субзатрата         = СтрокаБР.СубЗатрата;
				КонецЕсли;
				
				Движение.Подразделение		= СтрокаБР.Подразделение;
				Движение.ПериодРасходов		= СтрокаБР.ПериодРасходов;
				Движение.Проект				= СтрокаБР.Проект;
			КонецЦикла;
		КонецЕсли; 
		
		Если СтрокаТЧ.Расход<>0 Тогда
			БР=РаспределитьСуммы(СтрокаТЧ,СтрокаТЧ.Расход);			
			Для Каждого СтрокаБР Из БР Цикл
				Движение					= Движения.ДенежныеСредства.Добавить();
				
				Движение.Период				= Дата;
				Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;			
				Движение.БанковскийСчет		= БанковскийСчет;			
				Движение.Валюта				= СтрокаТЧ.Валюта;
				
				Движение.Сумма				= СтрокаБР.Сумма;
				Если Дата>='20090101' Тогда
					Движение.СуммаУпр		= глПересчет(СтрокаБР.Сумма,СтрокаТЧ.Валюта,КурсВалютыОперации,ВалютаУпр,КурсУпр);
				КонецЕсли;
				
				Движение.СуммаДокумента		= СтрокаБР.Сумма;
				Движение.ВалютаДокумента	= СтрокаТЧ.Валюта;
				
				Движение.СтатьяДДС			= СтрокаБР.СтатьяДДС;	
				Движение.Отправитель		= Контрагент;
				Движение.Договор			= СтрокаТЧ.Договор;
				Движение.Комментарий        = СтрокаТЧ.НазначениеПлатежа;
				Если Дата > '20100901' Тогда
					Движение.Субзатрата         = СтрокаТЧ.СубЗатрата;
				КонецЕсли;
				
				Движение.Подразделение		= СтрокаБР.Подразделение;				
				Движение.ПериодРасходов		= СтрокаБР.ПериодРасходов;
				Движение.Проект				= СтрокаБР.Проект;
			КонецЦикла;
		КонецЕсли;		
		
		Если СтрокаТЧ.Приход<>0 И ТипЗнч(СтрокаТЧ.Документ)=Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") И НЕ СтрокаТЧ.Документ.Пустая() Тогда
			ПП=	СтрокаТЧ.Документ.ПолучитьОбъект();
			
			ПП.НомерВыписки			=Номер;
			ПП.СуммаОплаты			=СтрокаТЧ.Приход;
			ПП.ДатаОплаты			=Дата;
			ПП.КонтрагентПоВыписке	=СтрокаТЧ.Контрагент;
			
			ПП.Записать();
		КонецЕсли; 
	КонецЦикла;
	Если ОбменДанными.Загрузка Тогда
		Движения.ДенежныеСредства.Записать();
		Движения.Взаиморасчеты.Записать();
		Движения.Затраты.Записать();
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;
			
	Если ЕстьИзменения Тогда
		ИтогоПриход = Платежи.Итог("Приход");
		ИтогоРасход = Платежи.Итог("Расход");	
		
		//+++ Чирков 10.03.2026 - СФ на авансы - доп. проверка
		ПустойУИД = ПустойУИД();
		Для каждого СтрокаП Из Платежи Цикл
			Если СтрокаП.УИД_СтрокиПлатежа = ПустойУИД Тогда
				СтрокаП.УИД_СтрокиПлатежа = Новый УникальныйИдентификатор;			
			КонецЕсли;		
		КонецЦикла;
		//--- Чирков 10.03.2026
	КонецЕсли; 
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Для Каждого СтрокаТЧ Из Платежи Цикл
		Если СтрокаТЧ.Приход<>0 И ТипЗнч(СтрокаТЧ.Документ)=Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") И НЕ СтрокаТЧ.Документ.Пустая() Тогда
			ПП=	СтрокаТЧ.Документ.ПолучитьОбъект();
			
			ПП.НомерВыписки			= Неопределено;
			ПП.СуммаОплаты			= Неопределено;
			ПП.ДатаОплаты			= Неопределено;
			ПП.КонтрагентПоВыписке  = Неопределено;
			
			ПП.Записать();
		КонецЕсли	
	КонецЦикла;  
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Для Каждого СтрокаТЧ Из Платежи Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Документ) И ТипЗнч(СтрокаТЧ.Документ)=Тип("ДокументСсылка.ЗаявкаНаОплату") Тогда
			ЗНО=СтрокаТЧ.Документ;
			Если 1=2 Тогда
				ЗНО=Документы.ЗаявкаНаОплату.СоздатьДокумент();			
			КонецЕсли; 
			
			СуммаФактическая=СтрокаТЧ.Расход;			
			Если НЕ Проведен Тогда
				Состояние		=Перечисления.СостоянияЗаявокНаОплату.КОплате;
				СуммаФактическая=0;
			Иначе
				Если СуммаФактическая=ЗНО.СуммаЗаявки Тогда
					Состояние=Перечисления.СостоянияЗаявокНаОплату.Оплачена;
				Иначе
					Состояние=Перечисления.СостоянияЗаявокНаОплату.ЧастичноОплачена;
				КонецЕсли; 
			КонецЕсли;		
			
			Если ЗНО.СуммаФактическая<>СтрокаТЧ.Расход ИЛИ ЗНО.Состояние<>Состояние Тогда				
				Объект=СтрокаТЧ.Документ.ПолучитьОбъект();			
				
				Если Объект<>Неопределено Тогда
					Объект.Состояние				= Состояние;
					Объект.СуммаФактическая 		= СуммаФактическая;
					Объект.ДатаОплатыФактическая    = Дата;
				
					Объект.Записать();				
				КонецЕсли;				
			КонецЕсли; 			
		КонецЕсли; 	
	КонецЦикла;  
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Для каждого СтрокаТЧ Из Платежи Цикл
		СтрокаТЧ.УИД_СтрокиПлатежа = Неопределено;	
	КонецЦикла;
КонецПроцедуры
